{
  "Error": "0",
  "Time": 0.0102,
  "Total": "183",
  "Page": 21,
  "Books": [
    {
      "ID": 3128687534,
      "Title": "PHP and MySQL For Dummies, 4th Edition",
      "Description": "To be on the cutting edge, Web sites need to serve up HTML, CSS, and products specific to the needs of different customers using different browsers. An effective e-commerce site gathers information about users and provides information they need to ge ...",
      "Image": "http://s.it-ebooks-api.info/9/php_and_mysql_for_dummies_4th_edition.jpg",
      "isbn": "9780470527580"
    },
    {
      "ID": 1712153699,
      "Title": "Beginning PHP and MySQL E-Commerce, 2nd Edition",
      "SubTitle": "From Novice to Professional",
      "Description": "Beginning PHP and MySQL E-Commerce: From Novice to Professional, Second Edition covers every step of the design and building process involved in creating powerful, extendable e-commerce web sites. Based around a real-world example involving a web sit ...",
      "Image": "http://s.it-ebooks-api.info/6/beginning_php_and_mysql_e-commerce_2nd_edition.jpg",
      "isbn": "9781590598641"
    },
    {
      "ID": 2191501858,
      "Title": "PHP and MySQL Web Development, 4th Edition",
      "Description": "PHP and MySQL are popular open-source technologies that are ideal for quickly developing database-driven Web applications. PHP is a powerful scripting language designed to enable developers to create highly featured Web applications quickly, and MySQ ...",
      "Image": "http://s.it-ebooks-api.info/10/php_and_mysql_web_development_4th_edition.jpg",
      "isbn": "9780672329166"
    },
    {
      "ID": 4126030247,
      "Title": "Expert PHP and MySQL",
      "Description": "As the world's most popular, general purpose, open source scripting language, PHP is frequently used with MySQL to create high-traffic, mission-critical applications. This indispensable book shares proven, author-tested best practices and expert tech ...",
      "Image": "http://s.it-ebooks-api.info/2/expert_php_and_mysql.jpg",
      "isbn": "9780470563120"
    },
    {
      "ID": 2725483026,
      "Title": "Beginning PHP 6, Apache, MySQL 6 Web Development",
      "Description": "Apache, MySQL and PHP are each complex in and of themselves, and it's impossible for this book to cover every advanced detail of all three. The purpose of this book is to give you the best possible foundation for understanding how each of the core co ...",
      "Image": "http://s.it-ebooks-api.info/2/beginning_php_6_apache_mysql_6_web_development.jpg",
      "isbn": "9780470391143"
    },
    {
      "ID": 869476162,
      "Title": "PHP and MySQL For Dummies, 3rd Edition",
      "Description": "Been thinking of creating a high-quality interactive Web site? This book is just what you need to get started! Here's the fun and easy way(r) to develop a Web application in PHP 4, 5, or 6 and MySQL 5, test your software, enable your Web pages to dis ...",
      "Image": "http://s.it-ebooks-api.info/9/php_and_mysql_for_dummies_3rd_edition.jpg",
      "isbn": "9780470096000"
    },
    {
      "ID": 1096327173,
      "Title": "PHP 6 and MySQL 6 Bible",
      "Description": "MySQL is the leading open source database on the market and PHP continues to dominate the server side of the scripting market - together, they are the most popular and common team for creating dynamic, database-driven web sites. This comprehensive bo ...",
      "Image": "http://s.it-ebooks-api.info/9/php_6_and_mysql_6_bible.jpg",
      "isbn": "9780470384503"
    },
    {
      "ID": 3775254278,
      "Title": "Expert PHP and MySQL",
      "SubTitle": "Application Design and Development",
      "Description": "Expert PHP and MySQL takes you beyond learning syntax to showing you how to apply proven software development methods to building commerce-grade PHP and MySQL projects that will stand the test of time and reliably deliver on customer needs.\n\nDevelo ...",
      "Image": "http://s.it-ebooks-api.info/6/expert_php_and_mysql.jpg",
      "isbn": "9781430260073"
    },
    {
      "ID": 4199565506,
      "Title": "Practical PHP and MySQL Website Databases",
      "SubTitle": "A Simplified Approach",
      "Description": "Practical PHP and MySQL Website Databases is a project-oriented book that demystifies building interactive, database-driven websites. The focus is on getting you up and running as quickly as possible. In the first two chapters you will set up your de ...",
      "Image": "http://s.it-ebooks-api.info/6/practical_php_and_mysql_website_databases.jpg",
      "isbn": "9781430260769"
    },
    {
      "ID": 3426521078,
      "Title": "PHP: The Good Parts",
      "SubTitle": "Delivering the Best of PHP",
      "Description": "Get past all the hype about PHP and dig into the real power of the language. This book explores the most useful features of PHP and how they can speed up the web development process, and explains why the most commonly used PHP elements are often misu ...",
      "Image": "http://s.it-ebooks-api.info/3/php_the_good_parts.jpg",
      "isbn": "9780596804374"
    },
    {
      "ID": 2382751283,
      "Title": "Head First SQL",
      "SubTitle": "Your Brain on SQL - A Learner's Guide",
      "Description": "Maybe you've written some simple SQL queries to interact with databases. But now you want more, you want to really dig into those databases and work with your data. Head First SQL will show you the fundamentals of SQL and how to really take advantage ...",
      "Image": "http://s.it-ebooks-api.info/3/head_first_sql.jpg",
      "isbn": "9780596526849"
    },
    {
      "ID": 2930028654,
      "Title": "SQL and Relational Theory",
      "SubTitle": "How to Write Accurate SQL Code",
      "Description": "Understanding SQL's underlying theory is the best way to guarantee that your SQL code is correct and your database schema is robust and maintainable. In SQL and Relational Theory, author C.J. Date demonstrates how you can apply relational theory dire ...",
      "Image": "http://s.it-ebooks-api.info/3/sql_and_relational_theory.jpg",
      "isbn": "9780596523060"
    },
    {
      "ID": 3861938756,
      "Title": "SQL Pocket Guide, 3rd Edition",
      "SubTitle": "A Guide to SQL Usage",
      "Description": "If you're a programmer or database administrator who uses SQL in your day-to-day work, this popular pocket guide is the ideal on-the-job reference. It uses numerous examples to address the language's complexity, and covers key aspects of SQL used in ...",
      "Image": "http://s.it-ebooks-api.info/3/sql_pocket_guide_third_edition.jpg",
      "isbn": "9781449394097"
    },
    {
      "ID": 1123599227,
      "Title": "Learning SQL, 2nd Edition",
      "SubTitle": "Master SQL Fundamentals",
      "Description": "Updated for the latest database management systems, this introductory guide will get you up and running with SQL quickly. Whether you need to write database applications, perform administrative tasks, or generate reports, Learning SQL, Second Edition ...",
      "Image": "http://s.it-ebooks-api.info/3/learning_sql_second_edition.jpg",
      "isbn": "9780596520830"
    },
    {
      "ID": 1081583253,
      "Title": "Oracle PL/SQL Language Pocket Reference, 4th Edition",
      "SubTitle": "A Guide to Oracle's PL/SQL Language Fundamentals",
      "Description": "The fourth edition of this popular pocket guide provides quick-reference information that will help you use Oracle's PL/SQL language, including the newest Oracle Database 11g features. A companion to Steven Feuerstein and Bill Pribyl's bestselling Or ...",
      "Image": "http://s.it-ebooks-api.info/3/oracle_plsql_language_pocket_reference_fourth_edition.jpg",
      "isbn": "9780596514044"
    },
    {
      "ID": 3687486784,
      "Title": "Beginning SQL Server Modeling",
      "SubTitle": "Model-Driven Application Development in SQL Server 2008",
      "Description": "Beginning SQL Server Modeling will help you gain a comprehensive understanding of how to apply DSLs and other modeling components in the development of SQL Server implementations. Most importantly, after reading the book and working through the examp ...",
      "Image": "http://s.it-ebooks-api.info/6/beginning_sql_server_modeling.jpg",
      "isbn": "9781430227519"
    },
    {
      "ID": 3557692628,
      "Title": "Pro SQL Database for Windows Azure, 2nd Edition",
      "SubTitle": "SQL Server in the Cloud",
      "Description": "Pro SQL Database for Windows Azure, 2nd Edition shows how to create enterprise-level database deployments without the usual investment in datacenter and other infrastructure. Take advantage instead of Microsoft's worldwide backbone for cloud computin ...",
      "Image": "http://s.it-ebooks-api.info/6/pro_sql_database_for_windows_azure_2nd_edition.jpg",
      "isbn": "9781430243953"
    },
    {
      "ID": 1025718732,
      "Title": "Microsoft SQL Azure: Enterprise Application Development",
      "SubTitle": "Build enterprise-ready applications and projects with SQL Azure",
      "Description": "Develop large scale enterprise applications using Microsoft SQL Azure. Understand how to use the various third party programs such as DB Artisan, RedGate, ToadSoft etc developed for SQL Azure. Master the exhaustive Data migration and Data Synchroniza ...",
      "Image": "http://s.it-ebooks-api.info/14/microsoft_sql_azure_enterprise_application_development.jpg",
      "isbn": "9781849680806"
    },
    {
      "ID": 1749859432,
      "Title": "Microsoft SQL Server 2008 R2 Administration Cookbook",
      "SubTitle": "Over 70 practical recipes for administering a high-performance SQL Server 2008 R2 system",
      "Description": "Provides Advanced Administration techniques for SQL Server 2008 R2 as a book. Covers the essential Manageability, Programmability, and Security features. Emphasizes important High Availability features and implementation. Explains how to maintain and ...",
      "Image": "http://s.it-ebooks-api.info/14/microsoft_sql_server_2008_r2_administration_cookbook.jpg",
      "isbn": "9781849681445"
    },
    {
      "ID": 1324819231,
      "Title": "Microsoft SQL Server 2008 High Availability",
      "SubTitle": "Minimize downtime, speed up recovery, and achieve the highest level of availability and reliability for SQL server applications by mastering the concepts of database mirroring, log shipping, clusterin",
      "Description": "Install various SQL Server High Availability options in a step-by-step manner. A guide to SQL Server High Availability for DBA aspirants, proficient developers and system administrators. Learn the pre and post installation concepts and common issues ...",
      "Image": "http://s.it-ebooks-api.info/14/microsoft_sql_server_2008_high_availability.jpg",
      "isbn": "9781849681223"
    },
    {
      "ID": 1196558874,
      "Title": "Head First JavaScript",
      "SubTitle": "A Learner's Companion to JavaScript",
      "Description": "Want to make the leap from writing HTML and CSS web pages and create dynamic web applications? Want to take your web skills to the next level? It sounds like you're ready to learn the Web's hottest programming language: JavaScript. Head First JavaScr ...",
      "Image": "http://s.it-ebooks-api.info/3/head_first_javascript.jpg",
      "isbn": "9780596527747"
    },
    {
      "ID": 1195998323,
      "Title": "JavaScript: The Good Parts",
      "SubTitle": "Unearthing the Excellence in JavaScript",
      "Description": "Most programming languages contain good and bad parts, but JavaScript has more than its share of the bad, having been developed and released in a hurry before it could be refined. This authoritative book scrapes away these bad features to reveal a su ...",
      "Image": "http://s.it-ebooks-api.info/3/javascript_the_good_parts.jpg",
      "isbn": "9780596517748"
    },
    {
      "ID": 1689934194,
      "Title": "Learning JavaScript Design Patterns",
      "SubTitle": "A JavaScript and jQuery Developer's Guide",
      "Description": "If you want to write beautiful, structured, and maintainable JavaScript code, this guide shows you how to apply both classical and modern design patterns to the language. The patterns in this book provide reusable code solutions to common problems in ...",
      "Image": "http://s.it-ebooks-api.info/3/learning_javascript_design_patterns.jpg",
      "isbn": "9781449331818"
    },
    {
      "ID": 3234496620,
      "Title": "Learning JavaScript",
      "SubTitle": "A Hands-On Guide to the Fundamentals of Modern JavaScript",
      "Description": "With the arrival of HTML5, jQuery, and Ajax, JavaScript web development skills are more valuable  than ever! This complete, hands-on JavaScript tutorial covers everything you need to know now.  Using line-by-line code walkthroughs and end-of-chapter ...",
      "Image": "http://s.it-ebooks-api.info/10/learning_javascript.jpg",
      "isbn": "9780321832740"
    },
    {
      "ID": 3285308904,
      "Title": "JavaScript Enlightenment",
      "SubTitle": "From Library User to JavaScript Developer",
      "Description": "If you're an advanced beginner or intermediate JavaScript developer, JavaScript Enlightenment will solidify your understanding of the language - especially if you use a JavaScript library. In this concise book, JavaScript expert Cody Lindley (jQuery ...",
      "Image": "http://s.it-ebooks-api.info/3/javascript_enlightenment.jpg",
      "isbn": "9781449342883"
    },
    {
      "ID": 421958423,
      "Title": "Getting Started with Meteor.js JavaScript Framework",
      "SubTitle": "Develop modern web applications in Meteor, one of the hottest new JavaScript platforms",
      "Description": "Meteor is a brand new platform built entirely in JavaScript that allows you to build modern, dynamic web applications in the blink of an eye. With support for nearly every popular JavaScript framework (and more being added every day), Meteor provides ...",
      "Image": "http://s.it-ebooks-api.info/14/getting_started_with_meteor.js_javascript_framework.jpg",
      "isbn": "9781782160823"
    },
    {
      "ID": 3812702641,
      "Title": "JavaScript Testing with Jasmine",
      "SubTitle": "JavaScript Behavior-Driven Development",
      "Description": "Get a concise introduction to Jasmine, the popular behavior-driven testing framework for JavaScript. This practical guide shows you how to write unit tests with Jasmine that automatically check for bugs in your application. Learn how to write specifi ...",
      "Image": "http://s.it-ebooks-api.info/3/javascript_testing_with_jasmine.jpg",
      "isbn": "9781449356378"
    },
    {
      "ID": 469878427,
      "Title": "JavaScript for PHP Developers",
      "SubTitle": "A Concise Guide to Mastering JavaScript",
      "Description": "If you want to significantly expand your web development skills beyond PHP, this practical, hands-on book teaches you ECMAScript - the core JavaScript language - from the ground up. You'll discover some similarities between JavaScript and PHP, such a ...",
      "Image": "http://s.it-ebooks-api.info/3/javascript_for_php_developers.jpg",
      "isbn": "9781449320195"
    },
    {
      "ID": 2752282535,
      "Title": "JavaScript Testing",
      "SubTitle": "Test and debug JavaScript the easy way",
      "Description": "JavaScript is an important part of web development in today's Web 2.0 world. While there are many JavaScript frameworks in the market, learning to write, test, and debug JavaScript without the help of any framework will make you a better JavaScript d ...",
      "Image": "http://s.it-ebooks-api.info/14/javascript_testing.jpg",
      "isbn": "9781849510004"
    },
    {
      "ID": 3733509927,
      "Title": "Object-Oriented JavaScript",
      "SubTitle": "Create scalable, reusable high-quality JavaScript applications, and libraries",
      "Description": "This book treats JavaScript as a serious object-oriented language, showing you how to build robust, maintainable, and powerful libraries and applications. Along the way, we cover many of the recent innovations such as AJAX, JSON, and interesting desi ...",
      "Image": "http://s.it-ebooks-api.info/14/object-oriented_javascript.jpg",
      "isbn": "9781847194145"
    }
  ]
}